sphere_re500/0.orig/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0.0005;
boundaryField
{
    inlet  { type calculated; value uniform 0.0005; }
    outlet { type calculated; value uniform 0; }
    walls  { type slip; }
    sphere { type nutUSpaldingWallFunction; value uniform 0; }
}
